# StructuralSectionCommonTorsionalMomentOfInertia Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StructuralSectionCommonTorsionalMomentOfInertia Property
ParameterTypeId Class See Also
---
"Torsional Moment of Inertia"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StructuralSectionCommonTorsionalMomentOfInertia { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StructuralSectionCommonTorsionalMomentOfInertia As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StructuralSectionCommonTorsionalMomentOfInertia {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace